#Дано целое число N (>0). Найти значение выражения 1.1 - 1.2 + 1.3 - ... (N слагаемых, знаки чередуются). Условный оператор не использовать.
N = abs(int(input("Введите целое положительное число: ")))

result = 0

for i in range(N):
  num = input("Введите  целое число: ")
  while type(num) != int:
    try:
      num = int(num)
    except ValueError:
      print("Ошибка - неверное значение - попробуйте еще раз")
      print("Введите целое число: ")
  result += num * (-1) ** i

print(result)
